#include <iostream>
#include <fstream>
#include <Windows.h>
#include <string>
#include <stdexcept>
#include "Graph.h"
int main() {
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
//    int A[10][10] = {{0,8,9,9,0,0,0,0,0,18},
//                     {8,0,0,9,8,0,7,0,9,10},
//                     {9,0,0,3,0,6,0,0,0,0},
//                     {9,9,3,0,2,4,0,0,0,0},
//                     {0,8,0,2,0,2,9,0,0,0},
//                     {0,0,6,4,2,0,9,0,0,0},
//                     {0,7,0,0,9,9,0,4,5,0},
//                     {0,0,0,0,0,0,4,0,1,4},
//                     {0,9,0,0,0,0,5,1,0,3},
//                     {18,10,0,0,0,0,0,4,3,0}}; //проверка для остовного дерева
//    int A[6][6] =
//            {{0,7,9,0,0,14},
//            {7,0,10,15,0,0},
//            {9,10,0,11,0,2},
//            {0,15,11,0,6,0},
//            {0,0,0,6,0,9},
//            {14,0,2,0,9,0}}; //проверка для дейкстры
int A[7][7] = {{0,3,0,0,0,0,3},
               {0,0,6,0,2,0,0},
               {0,0,0,9,0,0,0},
               {0,0,0,0,0,0,0},
               {0,0,0,1,0,0,1},
               {3,1,0,0,2,0,0},
               {0,0,0,0,0,4,0}}; // проверка для потока
    Graph graph(A);
    int answer = graph.max_flow_problem(0, 3);
    std::cout << answer;
}
